In [1]:
import pandas as pd

In [2]:
#데이터 생성
test_data = {
    '팀이름' : ['아자아자', '할수있다', 'AI마피아', 'TF고수', '경사하강법', '광인사최고'],
    '창의성' : ['상', '중', '하', '상', '중', '하'],
    '완성도' : [100, 80, 70, 90, 50, 60],
    '사업성' : ['좋음', '보통', '부족', '보통', '잘함', '못함']
        }

df = pd.DataFrame(test_data, index=['11팀', '12팀', '13팀', '14팀', '15팀', '16팀'])
df

       팀이름 창의성  완성도 사업성
11팀   아자아자   상  100  좋음
12팀   할수있다   중   80  보통
13팀  AI마피아   하   70  부족
14팀   TF고수   상   90  보통
15팀  경사하강법   중   50  잘함
16팀  광인사최고   하   60  못함

In [32]:
df = df.set_index(['창의성'])
df = df.drop(index='하', axis=0)

In [33]:
df.drop('상', inplace=True)
df

       팀이름  완성도 사업성
창의성
중     할수있다   80  보통
중    경사하강법   50  잘함

In [4]:
df = pd.DataFrame(test_data)

print(df[['팀이름', '사업성']])

     팀이름 사업성
0   아자아자  좋음
1   할수있다  보통
2  AI마피아  부족
3   TF고수  보통
4  경사하강법  잘함
5  광인사최고  못함

In [ ]:
df.팀이름

In [ ]:
df[['팀이름', '사업성']]

In [ ]:
df.loc['11팀':'15팀'] #끝 인덱스 포함

In [ ]:
df.iloc[1:5] #끝 인덱스 제외

In [4]:
test_data = {
    
    '이름' : ['상우', '현정', '문영', '동엽', '우제'],
    '국어' : [85, 88, 90, 50, 70],
    '수학' : [57, 90,100, 78, 66],
    '영어' : [85, 89, 100, 78, 66],
    '과학' : [93, 79, 92, 50, 70],
    '체육' : [94, 80, 99, 69, 100],
}

In [5]:
# 이름 컬럼을 인덱스로 지정

df = pd.DataFrame(test_data)

df.set_index('이름', inplace=True)
df

    국어   수학   영어  과학   체육
이름
상우  85   57   85  93   94
현정  88   90   89  79   80
문영  90  100  100  92   99
동엽  50   78   78  50   69
우제  70   66   66  70  100

In [19]:
df.index

Index(['상우', '현정', '문영', '동엽', '우제'], dtype='object', name='이름')

In [17]:
a = df[df['이름'] = '동엽'].index
a

SyntaxError: invalid syntax (<ipython-input-17-80e15b752855>, line 1)

In [15]:
ndf = df.drop(index='상우')

In [11]:
df.loc[['문영'],['영어']]

     영어
이름
문영  100

In [12]:
df.iloc[[2],[2]]

     영어
이름
문영  100

In [13]:
df.loc[['문영', '동엽'],['영어', '국어']]

     영어  국어
이름
문영  100  90
동엽   78  50

In [14]:
df.iloc[[2,3],[0,4]]

    국어  체육
이름
문영  90  99
동엽  50  69

In [15]:
df.국어

이름
상우    85
현정    88
문영    90
동엽    50
우제    70
Name: 국어, dtype: int64

In [16]:
df['국어']

이름
상우    85
현정    88
문영    90
동엽    50
우제    70
Name: 국어, dtype: int64

In [2]:
test_data = {
    
    '이름' : ['상우', '현정', '문영', '동엽', '우제'],
    '국어' : [85, 88, 90, 50, 70],
    '수학' : [57, 90,100, 78, 66],
    '영어' : [85, 89, 100, 78, 66],
    '과학' : [93, 79, 92, 50, 70],
    '체육' : [94, 80, 99, 69, 100],
}

df = pd.DataFrame(test_data)
df

   이름  국어   수학   영어  과학   체육
0  상우  85   57   85  93   94
1  현정  88   90   89  79   80
2  문영  90  100  100  92   99
3  동엽  50   78   78  50   69
4  우제  70   66   66  70  100

In [ ]:
df[df]

In [18]:
df.set_index('이름', inplace = True)
df

    국어   수학   영어  과학   체육
이름
상우  85   57   85  93   94
현정  88   90   89  79   80
문영  90  100  100  92   99
동엽  50   78   78  50   69
우제  70   66   66  70  100

In [19]:
df.loc[['상우'],['국어', '수학']]
# df.iloc[0:2,0:2]

    국어  수학
이름
상우  85  57

In [20]:
df.loc[5] = [1,1,1,1,1]
df

    국어   수학   영어  과학   체육
이름
상우  85   57   85  93   94
현정  88   90   89  79   80
문영  90  100  100  92   99
동엽  50   78   78  50   69
우제  70   66   66  70  100
5    1    1    1   1    1

In [21]:
df.set_index('국어', inplace=True)
df

     수학   영어  과학   체육
국어
85   57   85  93   94
88   90   89  79   80
90  100  100  92   99
50   78   78  50   69
70   66   66  70  100
1     1    1   1    1

In [22]:
new_index = [1,2,3,4,5,6,7]

df = df.reindex(new_index)
df

     수학   영어   과학   체육
국어
1   1.0  1.0  1.0  1.0
2   NaN  NaN  NaN  NaN
3   NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN

In [3]:
test_data = {  
    '상호명' : ['상우네', '현정이네', '문영이네', '동엽이네', '우제네'],
    '사과' : [1000, 900, 1200, 500, 800],
    '배' : [1100, 900, 1000, 1100, 2000],
    '딸기' : [800, 900, 600, 900 ,1200],
    '포도' : [1500, 900, 1000, 800, 900],
}

df = pd.DataFrame(test_data)
df

    상호명    사과     배    딸기    포도
0   상우네  1000  1100   800  1500
1  현정이네   900   900   900   900
2  문영이네  1200  1000   600  1000
3  동엽이네   500  1100   900   800
4   우제네   800  2000  1200   900

In [24]:
new_df1 = df.set_index('상호명')
new_df1

        사과     배    딸기    포도
상호명
상우네   1000  1100   800  1500
현정이네   900   900   900   900
문영이네  1200  1000   600  1000
동엽이네   500  1100   900   800
우제네    800  2000  1200   900

In [25]:
df = pd.DataFrame(df, index = [1,2,3,4,5])
df

    상호명      사과       배      딸기      포도
1  현정이네   900.0   900.0   900.0   900.0
2  문영이네  1200.0  1000.0   600.0  1000.0
3  동엽이네   500.0  1100.0   900.0   800.0
4   우제네   800.0  2000.0  1200.0   900.0
5   NaN     NaN     NaN     NaN     NaN

In [27]:
new_df.sort_values('사과', ascending=False)

NameError: name 'new_df' is not defined

In [ ]:
new_df.sort_values('포도', ascending=False)

In [ ]:
new_df.sort_index(ascending=True)

In [ ]:
new_df.sort_index(ascending=False, inplace=True)
new_df

In [ ]:
new_df.sort_values('사과', ascending=True, inplace=True)
new_df

In [ ]:
new_df.set_index('상호명')

In [ ]:
#  del new_df['딸기'] 
new_df.drop('배', axis=1)

In [ ]:
new_df

In [ ]:
new_df.drop('배', axis=1)

In [ ]:
new_df.drop(['배', '사과'], axis = 1)

In [ ]:
new_df.drop(columns=['배', '사과'])

In [ ]:
new_df.drop([1,2])

In [ ]:
new_df = new_df.drop('우제네')

In [ ]:
df = pd.read_csv('test.csv')
df

In [ ]:
data = {
    'name':['hak','hwa,', 'en'],
    'math' : [1,2,3],
    'abc':[2,3,4],
    'dfg' : [3,4,5]
}

df = pd.DataFrame(data)
df.set_index('name',  inplace=True)

In [ ]:
df

In [ ]:
df.to_csv('./df_to_csv.csv')

In [ ]:
df = pd.read_csv('./df_to_csv.csv')

In [ ]:
df = pd.read_json('./json_to_df.json')

In [ ]:
df

In [ ]:
df.to_json('./test_json_save.json')
df.to_excel('./test_save_excel.xls')

In [ ]:
# 통계 메서드

from random import *


# 난수 생성
data_1 = []
data_2 = []
for i in range(0, 10):
    data_1.append(uniform(0,1))
for i in range(0, 10):
    data_2.append(uniform(0,1))
    
# DataFrame 생성
dict_data = {
    'first' : data_1,
    'second' : data_2,
}

index_data = ['zero', '1st', '2st', '3st', '4st', '5st', '6st', '7st',  '8st', '9st']

df = pd.DataFrame(dict_data, index = index_data)
df

In [ ]:
# 평균
df.mean()
df['first'].mean()
df['second'].mean()

In [ ]:
# 최댓값
df.max()
df['first'].max()
df['second'].max()

In [ ]:
# 최솟값
df.min()
df['first'].min()
df['second'].min()

In [ ]:
import seaborn as sns

In [ ]:
df = sns.load_dataset('titanic')
df

In [ ]:
sr1 = df.isnull().sum()
sr2 = df.notnull().sum()
sr3 = sr1+sr2

In [ ]:
sr1

In [ ]:
sr2

In [ ]:
sr3

In [ ]:
new_df = pd.DataFrame(sr1)
new_df['sr2'] = sr2
new_df['sr3'] = sr3
new_df

In [ ]:
columns_a = [sr1, sr2, sr3]

df = pd.DataFrame(new_df, columns = [1,2,3])
df

In [ ]:
ndf = df.dropna(axis=1, thresh=445)
ndf.columns

In [ ]:
ndf.isnull().sum()

In [3]:
data = {
    'c0' : ['a', 'a', 'c', 'd', 'e', 'f', 'c'],
    'c1' : [1,1,2,3,4,5,2],
    'c2' :  ['a', 'a', 'c', 'd', 'e', 'f', 'c']
 }

df = pd.DataFrame(data)

In [4]:
#중복된 레이블 판별
duplicated_df = df.duplicated()

duplicated_df

0    False
1     True
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [5]:
df.drop_duplicates(inplace=True)
df

  c0  c1 c2
0  a   1  a
2  c   2  c
3  d   3  d
4  e   4  e
5  f   5  f

In [6]:
corona_df = pd.read_csv('./PatientRoute.csv')

In [7]:
corona_df['Year'] = corona_df['new_date'].dt.year

KeyError: 'new_date'

In [8]:
corona_df.head()

,patient_id,global_num,date,province,city,type,latitude,longitude
0,1000000001,2.0,2020-01-22,Gyeonggi-do,Gimpo-si,airport,37.615246,126.715632
1,1000000001,2.0,2020-01-24,Seoul,Jung-gu,hospital,37.567241,127.005659
2,1000000002,5.0,2020-01-25,Seoul,Seongbuk-gu,etc,37.592560,127.017048
3,1000000002,5.0,2020-01-26,Seoul,Seongbuk-gu,store,37.591810,127.016822
4,1000000002,5.0,2020-01-26,Seoul,Seongdong-gu,public_transportation,37.563992,127.029534

In [9]:
corona_df['new_date'] = pd.to_datetime(corona_df['date'])

In [10]:
corona_df.set_index('new_date', inplace=True)
corona_df.head()

,patient_id,global_num,date,province,city,type,latitude,longitude
new_date,,,,,,,,
2020-01-22,1000000001,2.0,2020-01-22,Gyeonggi-do,Gimpo-si,airport,37.615246,126.715632
2020-01-24,1000000001,2.0,2020-01-24,Seoul,Jung-gu,hospital,37.567241,127.005659
2020-01-25,1000000002,5.0,2020-01-25,Seoul,Seongbuk-gu,etc,37.592560,127.017048
2020-01-26,1000000002,5.0,2020-01-26,Seoul,Seongbuk-gu,store,37.591810,127.016822
2020-01-26,1000000002,5.0,2020-01-26,Seoul,Seongdong-gu,public_transportation,37.563992,127.029534

In [11]:
corona_df_ym = corona_df.loc['2020-02']
corona_df_ym

,patient_id,global_num,date,province,city,type,latitude,longitude
new_date,,,,,,,,
2020-02-01,1000000009,19.0,2020-02-01,Seoul,Songpa-gu,etc,37.498450,127.107250
2020-02-01,1000000009,19.0,2020-02-01,Incheon,Yeonsu-gu,store,37.381479,126.657175
2020-02-01,1000000009,19.0,2020-02-01,Incheon,Yeonsu-gu,store,37.381479,126.657175
2020-02-03,1000000009,19.0,2020-02-03,Gyeonggi-do,Seongnam-si,etc,37.382699,127.118906
2020-02-03,1000000009,19.0,2020-02-03,Gyeonggi-do,Seongnam-si,restaurant,37.377139,127.112750
...,...,...,...,...,...,...,...,...
2020-02-27,6100000070,NaN,2020-02-27,Gyeongsangnam-do,Changnyeong-gun,hospital,35.542636,128.492066
2020-02-27,6100000070,NaN,2020-02-27,Gyeongsangnam-do,Changnyeong-gun,pharmacy,35.542636,128.492066
2020-02-27,6100000070,NaN,2020-02-27,Gyeongsangnam-do,Changnyeong-gun,etc,35.541315,128.500770
2020-02-22,6100000083,NaN,2020-02-22,Daegu,Jung-gu,etc,35.871435,128.601445
2020-02-22,6100000083,NaN,2020-02-22,Gyeongsangnam-do,Geoje-si,store,34.856049,128.725042

In [13]:
corona_df_ym_cols = corona_df.loc['2020', ['city', 'longitude']]
corona_df_ym_cols

                    city   longitude
new_date
2020-01-22      Gimpo-si  126.715632
2020-01-24       Jung-gu  127.005659
2020-01-25   Seongbuk-gu  127.017048
2020-01-26   Seongbuk-gu  127.016822
2020-01-26  Seongdong-gu  127.029534
...                  ...         ...
2020-03-24    Gangseo-gu  126.794474
2020-03-24    Gangseo-gu  128.946459
2020-03-25    Yangsan-si  129.026389
2020-03-25    Yangsan-si  129.025003
2020-03-25    Yangsan-si  129.026389

[6714 rows x 2 columns]

### 열이름을 이용한 필터링

In [8]:
import os
import pandas as pd
import numpy as np

os.chdir('C:\\Users\doch2\\@handinpandas\\data')

In [9]:
#특정 열에 대한 정보를 가져오기
flight_route_info = pd.read_csv('./flight_route_info.csv', encoding='cp949')

In [10]:
flight_route_info.filter(regex='\d')

,2016.6,2018.5,운항_2016,운항_2017,운항_2018,운항_2016.12,운항_2017.1,운항_2017.2,운항_2017.12,운항_2018.1,...,운송량_2016여름,운송량_2017여름,운송량_2016.9,운송량_2016.10,운송량_2016.11,운송량_2017.9,운송량_2017.10,운송량_2017.11,운송량_2016가을,운송량_2017가을
0,O,O,30,43,22,4,4,4,4,4,...,2321,1937,842,985,596,746,597,448,2423,1791
1,O,O,31,21,23,4,3,4,2,5,...,2321,1119,794,815,990,224,0,0,2599,224
2,O,O,31,41,16,5,4,3,5,4,...,1937,2012,970,896,596,745,448,448,2462,1641
3,O,O,4,2,9,2,0,0,2,1,...,0,0,0,0,298,0,0,0,298,0
4,O,O,29,24,9,4,4,3,4,1,...,2561,1043,767,788,596,298,0,0,2151,298
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
672,O,O,104,131,0,17,18,13,0,0,...,8127,7371,2457,2646,3192,2457,2268,0,8295,4725
673,O,O,72,194,132,9,9,6,26,28,...,5481,10017,2268,2457,1701,3024,3402,4725,6426,11151
674,O,O,0,1,0,0,0,0,1,0,...,0,0,0,0,0,0,0,0,0,0
675,O,O,35,12,0,7,4,4,0,0,...,567,0,1512,1512,1701,0,0,0,4725,0
676,O,O,30,15,0,9,7,8,0,0,...,0,0,756,1701,1512,0,0,0,3969,0

In [11]:
flight_route_info['비고'].value_counts(dropna=False)

NaN                                    412
2016.11.05. 이후 폐선                        4
2018.04.24. 이후 기록 없음                     3
2017.07 한 달                              2
2017.03.24. 이후 폐선                        2
                                      ...
2018.05.26. 이후 기록 없음                     1
2017.09.17 이후 폐선                         1
2017.05~2017.07                          1
2017.11.05.부터                            1
2017.08.25. 2017.09.07. 2017.09.09.      1
Name: 비고, Length: 247, dtype: int64

In [12]:
flight_route_info.fillna('', axis=1, inplace=True)

In [13]:
flight_route_info['비고'].value_counts(dropna=False).head()

                        412
2016.11.05. 이후 폐선         4
2018.04.24. 이후 기록 없음      3
2018.03.08. 하루 운항         2
2017.03.24. 이후 폐선         2
Name: 비고, dtype: int64

In [14]:
import numpy as np
import pandas as pd

s = pd.Series([0,1, np.nan, 3])
s.interpolate()

0    0.0
1    1.0
2    2.0
3    3.0
dtype: float64

In [15]:
airplane_info = pd.read_csv('./airplane_info.csv', encoding='cp949')

In [16]:
airplane_info.isnull().sum()

기체번호     0
항공사      0
기종       0
정원_F     0
정원_C     0
정원_W     0
정원_Y     0
총정원     71
dtype: int64

In [17]:
airplane_info[['기체번호', '총정원']]

        기체번호    총정원
0     VP-BDK  140.0
1     VP-BWD  140.0
2     VP-BWE  140.0
3     VP-BWF  140.0
4     VP-BRZ  140.0
...      ...    ...
2173  VP-BWW    NaN
2174  VP-BRM    NaN
2175  VP-BWZ    NaN
2176  VP-BWX    NaN
2177  VP-BRB    NaN

[2178 rows x 2 columns]

In [18]:
airplane_info.총정원.mean()

172.05410536307545

In [19]:
# airplane_info.interpolate()

        기체번호        항공사        기종  정원_F  정원_C  정원_W  정원_Y    총정원
0     VP-BDK   Aeroflot  A320-214     0    20     0   120  140.0
1     VP-BWD   Aeroflot  A320-214     0    20     0   120  140.0
2     VP-BWE   Aeroflot  A320-214     0    20     0   120  140.0
3     VP-BWF   Aeroflot  A320-214     0    20     0   120  140.0
4     VP-BRZ   Aeroflot  A320-214     0    20     0   120  140.0
...      ...        ...       ...   ...   ...   ...   ...    ...
2173  VP-BWW  Red Wings  A320-232     0     0     0   180  180.0
2174  VP-BRM  Red Wings  A321-231     0     0     0   220  180.0
2175  VP-BWZ  Red Wings  A320-232     0     0     0   180  180.0
2176  VP-BWX  Red Wings  A320-232     0     0     0   180  180.0
2177  VP-BRB  Red Wings  A321-231     0     0     0   220  180.0

[2178 rows x 8 columns]

In [25]:
airplane_info.interpolate()

        기체번호        항공사        기종  정원_F  정원_C  정원_W  정원_Y    총정원
0     VP-BDK   Aeroflot  A320-214     0    20     0   120  140.0
1     VP-BWD   Aeroflot  A320-214     0    20     0   120  140.0
2     VP-BWE   Aeroflot  A320-214     0    20     0   120  140.0
3     VP-BWF   Aeroflot  A320-214     0    20     0   120  140.0
4     VP-BRZ   Aeroflot  A320-214     0    20     0   120  140.0
...      ...        ...       ...   ...   ...   ...   ...    ...
2173  VP-BWW  Red Wings  A320-232     0     0     0   180  180.0
2174  VP-BRM  Red Wings  A321-231     0     0     0   220  180.0
2175  VP-BWZ  Red Wings  A320-232     0     0     0   180  180.0
2176  VP-BWX  Red Wings  A320-232     0     0     0   180  180.0
2177  VP-BRB  Red Wings  A321-231     0     0     0   220  180.0

[2178 rows x 8 columns]

In [58]:
# np.set_printoptions(precision=3)
# pd.set_option("precision",3)
# %precision %.5f


a = airplane_info[['기종']].value_counts(normalize=True)

a_index = a.index
index_list = [i for i in a.index]
value_list =  [i for i in a.values]

p